# Pandas

## Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c','d','e']
my_list = [1,2,3,4,5]
arr = np.array([6,7,8,9,10])
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
pd.Series(arr)

0     6
1     7
2     8
3     9
4    10
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series([1,'alpha',2,'beta',1.3,sum])

0                          1
1                      alpha
2                          2
3                       beta
4                        1.3
5    <built-in function sum>
dtype: object

In [12]:
first_series = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
second_series = pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])

In [13]:
first_series

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
first_series['USA']

1

In [15]:
first_series + second_series

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrame

In [17]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [18]:
df

          W         X         Y         Z
A -0.124487 -1.016656  1.613279  0.558101
B  1.198447  0.305724  2.274774 -0.687968
C -1.257176 -1.343620  1.044556  2.200146
D -0.707757 -1.392336  1.706797 -1.230930
E -0.429300 -0.841688  1.369469 -0.007749

In [19]:
df['W']

A   -0.124487
B    1.198447
C   -1.257176
D   -0.707757
E   -0.429300
Name: W, dtype: float64

In [20]:
df[['W','Z']]

          W         Z
A -0.124487  0.558101
B  1.198447 -0.687968
C -1.257176  2.200146
D -0.707757 -1.230930
E -0.429300 -0.007749

In [21]:
df.W

A   -0.124487
B    1.198447
C   -1.257176
D   -0.707757
E   -0.429300
Name: W, dtype: float64

In [22]:
type(df['W'])

pandas.core.series.Series

In [23]:
df['new'] = df['W'] + df['X']

In [24]:
df

          W         X         Y         Z       new
A -0.124487 -1.016656  1.613279  0.558101 -1.141143
B  1.198447  0.305724  2.274774 -0.687968  1.504171
C -1.257176 -1.343620  1.044556  2.200146 -2.600796
D -0.707757 -1.392336  1.706797 -1.230930 -2.100093
E -0.429300 -0.841688  1.369469 -0.007749 -1.270988

In [25]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.124487 -1.016656  1.613279  0.558101
B  1.198447  0.305724  2.274774 -0.687968
C -1.257176 -1.343620  1.044556  2.200146
D -0.707757 -1.392336  1.706797 -1.230930
E -0.429300 -0.841688  1.369469 -0.007749

In [26]:
df

          W         X         Y         Z       new
A -0.124487 -1.016656  1.613279  0.558101 -1.141143
B  1.198447  0.305724  2.274774 -0.687968  1.504171
C -1.257176 -1.343620  1.044556  2.200146 -2.600796
D -0.707757 -1.392336  1.706797 -1.230930 -2.100093
E -0.429300 -0.841688  1.369469 -0.007749 -1.270988

In [27]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A -0.124487 -1.016656  1.613279  0.558101
B  1.198447  0.305724  2.274774 -0.687968
C -1.257176 -1.343620  1.044556  2.200146
D -0.707757 -1.392336  1.706797 -1.230930
E -0.429300 -0.841688  1.369469 -0.007749

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.124487 -1.016656  1.613279  0.558101
B  1.198447  0.305724  2.274774 -0.687968
C -1.257176 -1.343620  1.044556  2.200146
D -0.707757 -1.392336  1.706797 -1.230930

In [30]:
df.loc['A']

W   -0.124487
X   -1.016656
Y    1.613279
Z    0.558101
Name: A, dtype: float64

In [31]:
df.iloc[2]

W   -1.257176
X   -1.343620
Y    1.044556
Z    2.200146
Name: C, dtype: float64

In [32]:
df.loc['B','W']

1.1984465903316084

In [33]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.124487  1.613279
B  1.198447  2.274774

In [34]:
df

          W         X         Y         Z
A -0.124487 -1.016656  1.613279  0.558101
B  1.198447  0.305724  2.274774 -0.687968
C -1.257176 -1.343620  1.044556  2.200146
D -0.707757 -1.392336  1.706797 -1.230930
E -0.429300 -0.841688  1.369469 -0.007749

In [36]:
df>0

       W      X     Y      Z
A  False  False  True   True
B   True   True  True  False
C  False  False  True   True
D  False  False  True  False
E  False  False  True  False

In [35]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  1.613279  0.558101
B  1.198447  0.305724  2.274774       NaN
C       NaN       NaN  1.044556  2.200146
D       NaN       NaN  1.706797       NaN
E       NaN       NaN  1.369469       NaN

In [37]:
df[df['W']>0]

          W         X         Y         Z
B  1.198447  0.305724  2.274774 -0.687968

In [38]:
df[df['W']>0]['X']

B    0.305724
Name: X, dtype: float64

In [39]:
df[df['W']>0][['Y','X']]

          Y         X
B  2.274774  0.305724

In [40]:
df

          W         X         Y         Z
A -0.124487 -1.016656  1.613279  0.558101
B  1.198447  0.305724  2.274774 -0.687968
C -1.257176 -1.343620  1.044556  2.200146
D -0.707757 -1.392336  1.706797 -1.230930
E -0.429300 -0.841688  1.369469 -0.007749

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.124487 -1.016656  1.613279  0.558101
1     B  1.198447  0.305724  2.274774 -0.687968
2     C -1.257176 -1.343620  1.044556  2.200146
3     D -0.707757 -1.392336  1.706797 -1.230930
4     E -0.429300 -0.841688  1.369469 -0.007749

In [42]:
new_index = 'alpha beta charlie delta echo'.split()

In [43]:
df['new_ind'] = new_index

In [44]:
df

          W         X         Y         Z  new_ind
A -0.124487 -1.016656  1.613279  0.558101    alpha
B  1.198447  0.305724  2.274774 -0.687968     beta
C -1.257176 -1.343620  1.044556  2.200146  charlie
D -0.707757 -1.392336  1.706797 -1.230930    delta
E -0.429300 -0.841688  1.369469 -0.007749     echo

In [45]:
df.set_index('new_ind')

                W         X         Y         Z
new_ind
alpha   -0.124487 -1.016656  1.613279  0.558101
beta     1.198447  0.305724  2.274774 -0.687968
charlie -1.257176 -1.343620  1.044556  2.200146
delta   -0.707757 -1.392336  1.706797 -1.230930
echo    -0.429300 -0.841688  1.369469 -0.007749

In [46]:
df

          W         X         Y         Z  new_ind
A -0.124487 -1.016656  1.613279  0.558101    alpha
B  1.198447  0.305724  2.274774 -0.687968     beta
C -1.257176 -1.343620  1.044556  2.200146  charlie
D -0.707757 -1.392336  1.706797 -1.230930    delta
E -0.429300 -0.841688  1.369469 -0.007749     echo

In [48]:
df.set_index('new_ind',inplace=True)

In [49]:
df

                W         X         Y         Z
new_ind
alpha   -0.124487 -1.016656  1.613279  0.558101
beta     1.198447  0.305724  2.274774 -0.687968
charlie -1.257176 -1.343620  1.044556  2.200146
delta   -0.707757 -1.392336  1.706797 -1.230930
echo    -0.429300 -0.841688  1.369469 -0.007749

## Missing Value

In [50]:
df = pd.DataFrame({'A':[3,4,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [51]:
df

     A    B  C
0  3.0  5.0  1
1  4.0  NaN  2
2  NaN  NaN  3

In [52]:
df.dropna()

     A    B  C
0  3.0  5.0  1

In [53]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [55]:
df.dropna(thresh=2)

     A    B  C
0  3.0  5.0  1
1  4.0  NaN  2

In [56]:
df.fillna(value='No Data')

         A        B  C
0        3        5  1
1        4  No Data  2
2  No Data  No Data  3

In [57]:
df['A'].fillna(value=df['A'].mean())

0    3.0
1    4.0
2    3.5
Name: A, dtype: float64

## Group By

In [58]:
data = {'Company':['ADRO','ADRO','PTBA','PTBA','ANTM','ANTM'],
       'Person':['Andi','Budi','Caca','Dani','Ega','Faris'],
       'Sales':[200,150,350,120,245,370]}

In [59]:
df = pd.DataFrame(data)

In [60]:
df

  Company Person  Sales
0    ADRO   Andi    200
1    ADRO   Budi    150
2    PTBA   Caca    350
3    PTBA   Dani    120
4    ANTM    Ega    245
5    ANTM  Faris    370

In [61]:
df.groupby('Company')

In [62]:
df.groupby('Company').mean()

         Sales
Company
ADRO     175.0
ANTM     307.5
PTBA     235.0

In [63]:
df.groupby('Company').min()

        Person  Sales
Company
ADRO      Andi    150
ANTM       Ega    245
PTBA      Caca    120

In [64]:
df.groupby('Company').max()

        Person  Sales
Company
ADRO      Budi    200
ANTM     Faris    370
PTBA      Dani    350

In [65]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
ADRO      2.0  175.0   35.355339  150.0  162.50  175.0  187.50  200.0
ANTM      2.0  307.5   88.388348  245.0  276.25  307.5  338.75  370.0
PTBA      2.0  235.0  162.634560  120.0  177.50  235.0  292.50  350.0

## Concat, Merge and Join

In [73]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                        index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [74]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [75]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [76]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [77]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [78]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [79]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [80]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [81]:
left.merge(right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [84]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [85]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [86]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations and Apply Function

In [87]:
df = pd.DataFrame({'A':[1,2,3,4],
                  'B':[111,999,777,111],
                  'C':['abc','def','ghi','xyz']})

In [88]:
df

   A    B    C
0  1  111  abc
1  2  999  def
2  3  777  ghi
3  4  111  xyz

In [89]:
df['B'].unique()

array([111, 999, 777], dtype=int64)

In [90]:
df['B'].nunique()

3

In [91]:
df['B'].value_counts()

111    2
777    1
999    1
Name: B, dtype: int64

In [93]:
new_df = df[(df['A']>=3) & (df['B']==111)]

In [94]:
new_df

   A    B    C
3  4  111  xyz

In [95]:
def times2(x):
    return x*2

In [96]:
df['A'].apply(times2)

0    2
1    4
2    6
3    8
Name: A, dtype: int64

In [98]:
df['C'].apply(len)

0    3
1    3
2    3
3    3
Name: C, dtype: int64

In [99]:
df['A'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: A, dtype: int64

In [100]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [101]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [102]:
df.sort_values(by='B')

   A    B    C
0  1  111  abc
3  4  111  xyz
2  3  777  ghi
1  2  999  def

In [103]:
df.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [104]:
df.isnull().sum()

A    0
B    0
C    0
dtype: int64

In [105]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [107]:
df = pd.DataFrame(data)

In [108]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [109]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Input & Output File

In [112]:
df = pd.read_csv('pandas_csv_example.csv',sep=';')

In [113]:
df

   a   b   c   d
0  1   6  11  16
1  2   7  12  17
2  3   8  13  18
3  4   9  14  19
4  5  10  15  20

In [114]:
df.to_csv('new_csv_example',index=False)

In [116]:
df = pd.read_excel('pandas_excel_example.xlsx',sheet_name='Sheet1')

In [117]:
df

   a   b   c   d
0  1   6  11  16
1  2   7  12  17
2  3   8  13  18
3  4   9  14  19
4  5  10  15  20

In [118]:
df.to_excel('new_excel_example.xlsx',sheet_name='Sheet1')

# Good Job !